### 📋 Terraform Plan Generated
  
  <details><summary>Show Output</summary>
  
  ```
  [command]/home/runner/work/_temp/84f1ff8b-279d-4c10-a15b-861f2042d76e/terraform-bin plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_cloudfunctions_function.my_function[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_cloudfunctions_function" "my_function" {
      [32m+[0m [0m[1m[0mavailable_memory_mb[0m[0m           = 512
      [32m+[0m [0m[1m[0mbuild_service_account[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdocker_registry[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m              = {
          [32m+[0m [0m"environment"                = "Prod"
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mhttps_trigger_security_level[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhttps_trigger_url[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mingress_settings[0m[0m              = "ALLOW_ALL"
      [32m+[0m [0m[1m[0mlabels[0m[0m                        = {
          [32m+[0m [0m"environment" = "Prod"
        }
      [32m+[0m [0m[1m[0mmax_instances[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "test"
      [32m+[0m [0m[1m[0mproject[0m[0m                       = "test"
      [32m+[0m [0m[1m[0mregion[0m[0m                        = "us-central1"
      [32m+[0m [0m[1m[0mruntime[0m[0m                       = "nodejs20"
      [32m+[0m [0m[1m[0mservice_account_email[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m              = {
          [32m+[0m [0m"environment"                = "Prod"
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mtimeout[0m[0m                       = 60
      [32m+[0m [0m[1m[0mversion_id[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mvpc_connector_egress_settings[0m[0m = (known after apply)

      [32m+[0m [0mevent_trigger {
          [32m+[0m [0m[1m[0mevent_type[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mresource[0m[0m   = (known after apply)

          [32m+[0m [0mfailure_policy {
              [32m+[0m [0m[1m[0mretry[0m[0m = (known after apply)
            }
        }
    }

[1m  # google_compute_address.static_ip[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_address" "static_ip" {
      [32m+[0m [0m[1m[0maddress[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0maddress_type[0m[0m       = "EXTERNAL"
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0meffective_labels[0m[0m   = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "terraform-static-ip"
      [32m+[0m [0m[1m[0mnetwork_tier[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mprefix_length[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "polished-tube-312806"
      [32m+[0m [0m[1m[0mpurpose[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m             = "us-central1"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msubnetwork[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m   = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0musers[0m[0m              = (known after apply)
    }

[1m  # google_compute_firewall.internal_firewall[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "internal_firewall" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "internal-firewall"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "polished-tube-312806"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"10.0.0.0/24",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"0-65535",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"0-65535",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "udp"
        }
      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = []
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "icmp"
        }
    }

[1m  # google_compute_firewall.public_vm_firewall[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "public_vm_firewall" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "public-vm-firewall"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "polished-tube-312806"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"public-vm",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"22",
              [32m+[0m [0m"80",
              [32m+[0m [0m"443",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # google_compute_instance.my_instance[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "my_instance" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {
          [32m+[0m [0m"environment"                = "production"
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
          [32m+[0m [0m"service"                    = "web-app"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mlabels[0m[0m               = {
          [32m+[0m [0m"environment" = "production"
          [32m+[0m [0m"service"     = "web-app"
        }
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "n1-standard-16"
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = "test"
      [32m+[0m [0m[1m[0mproject[0m[0m              = "test"
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [32m+[0m [0m"environment"                = "production"
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
          [32m+[0m [0m"service"                    = "web-app"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-9"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = 4
          [32m+[0m [0m[1m[0mtype[0m[0m  = "nvidia-tesla-t4"
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m   = true
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m         = true
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m  = (known after apply)
        }
    }

[1m  # google_compute_instance.private_vm[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "private_vm" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"
      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {
          [32m+[0m [0m"ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDFB4ygMcxnTVTPknIyeIBcuMvh0oRl/9MVHAW1HBXzB/GNKqMk3WwvoOKXOe5s39rYaejCS1IVNu8yRtOn1kno8DaXCHtAnOnI1nIax2REDvuGJX8r6ZZTdperYFMF4MrrWakPYWzT2GLGSb+m2G3syvkZshZoj8o6I3ijHfMJ59vFWDgkJEJy6GpCnyWl9c9DGmlOpMD3zk9IfiLdfKZnPWIsIjGAknAJcCnqiS4n7D0q6Y7xA2EKIupvc37j/lbYoZb/XUGW6WI8fRufQjl/ay1sJFySGLi73CsFmpVefdArHPLuQM0zvQA62zxGTZqWubRVZXNSJKnzDp6jugqxXuXBgPsd1u6ZN+yjKvu6K9GQLQ48/T/xOFpFsZ0sf+EajCrQ2r2SahQ4fErH5SrdFSm+ZyLDiKAir2NbYSFw7yAkqHqrajYiYBtTC+Qsm9tI3djMwi6Uk719JR7Po5p7BGO/5vRHopOVb8p+w9C2LCiA9ACdL6GJH3gNId3OsLU= feri@MacBook-Pro-Feri.local"
        }
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = "private-vm-1"
      [32m+[0m [0m[1m[0mproject[0m[0m              = "polished-tube-312806"
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-11"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)

          [32m+[0m [0mlocal_ssd_recovery_timeout {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mmax_run_duration {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }

          [32m+[0m [0mon_instance_stop_action {
              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)
            }
        }
    }

[1m  # google_compute_instance.private_vm[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "private_vm" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"
      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {
          [32m+[0m [0m"ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDFB4ygMcxnTVTPknIyeIBcuMvh0oRl/9MVHAW1HBXzB/GNKqMk3WwvoOKXOe5s39rYaejCS1IVNu8yRtOn1kno8DaXCHtAnOnI1nIax2REDvuGJX8r6ZZTdperYFMF4MrrWakPYWzT2GLGSb+m2G3syvkZshZoj8o6I3ijHfMJ59vFWDgkJEJy6GpCnyWl9c9DGmlOpMD3zk9IfiLdfKZnPWIsIjGAknAJcCnqiS4n7D0q6Y7xA2EKIupvc37j/lbYoZb/XUGW6WI8fRufQjl/ay1sJFySGLi73CsFmpVefdArHPLuQM0zvQA62zxGTZqWubRVZXNSJKnzDp6jugqxXuXBgPsd1u6ZN+yjKvu6K9GQLQ48/T/xOFpFsZ0sf+EajCrQ2r2SahQ4fErH5SrdFSm+ZyLDiKAir2NbYSFw7yAkqHqrajYiYBtTC+Qsm9tI3djMwi6Uk719JR7Po5p7BGO/5vRHopOVb8p+w9C2LCiA9ACdL6GJH3gNId3OsLU= feri@MacBook-Pro-Feri.local"
        }
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = "private-vm-2"
      [32m+[0m [0m[1m[0mproject[0m[0m              = "polished-tube-312806"
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-11"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)

          [32m+[0m [0mlocal_ssd_recovery_timeout {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mmax_run_duration {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }

          [32m+[0m [0mon_instance_stop_action {
              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)
            }
        }
    }

[1m  # google_compute_instance.public_vm[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "public_vm" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"
      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {
          [32m+[0m [0m"ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDFB4ygMcxnTVTPknIyeIBcuMvh0oRl/9MVHAW1HBXzB/GNKqMk3WwvoOKXOe5s39rYaejCS1IVNu8yRtOn1kno8DaXCHtAnOnI1nIax2REDvuGJX8r6ZZTdperYFMF4MrrWakPYWzT2GLGSb+m2G3syvkZshZoj8o6I3ijHfMJ59vFWDgkJEJy6GpCnyWl9c9DGmlOpMD3zk9IfiLdfKZnPWIsIjGAknAJcCnqiS4n7D0q6Y7xA2EKIupvc37j/lbYoZb/XUGW6WI8fRufQjl/ay1sJFySGLi73CsFmpVefdArHPLuQM0zvQA62zxGTZqWubRVZXNSJKnzDp6jugqxXuXBgPsd1u6ZN+yjKvu6K9GQLQ48/T/xOFpFsZ0sf+EajCrQ2r2SahQ4fErH5SrdFSm+ZyLDiKAir2NbYSFw7yAkqHqrajYiYBtTC+Qsm9tI3djMwi6Uk719JR7Po5p7BGO/5vRHopOVb8p+w9C2LCiA9ACdL6GJH3gNId3OsLU= feri@MacBook-Pro-Feri.local"
        }
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = "public-vm"
      [32m+[0m [0m[1m[0mproject[0m[0m              = "polished-tube-312806"
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = [
          [32m+[0m [0m"public-vm",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-11"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)

          [32m+[0m [0mlocal_ssd_recovery_timeout {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mmax_run_duration {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }

          [32m+[0m [0mon_instance_stop_action {
              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)
            }
        }
    }

[1m  # google_compute_network.vpc_network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "vpc_network" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m                   = false
      [32m+[0m [0m[1m[0mbgp_always_compare_med[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mbgp_best_path_selection_mode[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mbgp_inter_region_cost[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m           = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                        = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_range[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                      = "terraform-network"
      [32m+[0m [0m[1m[0mnetwork_firewall_policy_enforcement_order[0m[0m = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m [0m[1m[0mnetwork_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mnumeric_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                                   = "polished-tube-312806"
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                                 = (known after apply)
    }

[1m  # google_compute_subnetwork.subnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnet" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0menable_flow_logs[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "10.0.0.0/24"
      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mipv6_gce_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "terraform-subnet"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_google_access[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "polished-tube-312806"
      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "us-central1"
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mstate[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0msubnetwork_id[0m[0m              = (known after apply)

      [32m+[0m [0msecondary_ip_range {
          [32m+[0m [0m[1m[0mip_cidr_range[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mrange_name[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mreserved_internal_range[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 10 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mprivate_vm_internal_ips[0m[0m = [
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
    ]
  [32m+[0m [0m[1m[0mprivate_vm_names[0m[0m        = [
      [32m+[0m [0m"private-vm-1",
      [32m+[0m [0m"private-vm-2",
    ]
  [32m+[0m [0m[1m[0mpublic_vm_external_ip[0m[0m   = (known after apply)
  [32m+[0m [0m[1m[0mpublic_vm_internal_ip[0m[0m   = (known after apply)
  [32m+[0m [0m[1m[0mpublic_vm_name[0m[0m          = "public-vm"
  [32m+[0m [0m[1m[0msubnet_cidr[0m[0m             = "10.0.0.0/24"
  [32m+[0m [0m[1m[0msubnet_name[0m[0m             = "terraform-subnet"
  [32m+[0m [0m[1m[0mvpc_network_name[0m[0m        = "terraform-network"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create%0A[0m%0ATerraform will perform the following actions:%0A%0A[1m  # google_cloudfunctions_function.my_function[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_cloudfunctions_function" "my_function" {%0A      [32m+[0m [0m[1m[0mavailable_memory_mb[0m[0m           = 512%0A      [32m+[0m [0m[1m[0mbuild_service_account[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mdocker_registry[0m[0m               = (known after apply)%0A      [32m+[0m [0m[1m[0meffective_labels[0m[0m              = {%0A          [32m+[0m [0m"environment"                = "Prod"%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mhttps_trigger_security_level[0m[0m  = (known after apply)%0A      [32m+[0m [0m[1m[0mhttps_trigger_url[0m[0m             = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)%0A      [32m+[0m [0m[1m[0mingress_settings[0m[0m              = "ALLOW_ALL"%0A      [32m+[0m [0m[1m[0mlabels[0m[0m                        = {%0A          [32m+[0m [0m"environment" = "Prod"%0A        }%0A      [32m+[0m [0m[1m[0mmax_instances[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m                          = "test"%0A      [32m+[0m [0m[1m[0mproject[0m[0m                       = "test"%0A      [32m+[0m [0m[1m[0mregion[0m[0m                        = "us-central1"%0A      [32m+[0m [0m[1m[0mruntime[0m[0m                       = "nodejs20"%0A      [32m+[0m [0m[1m[0mservice_account_email[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mstatus[0m[0m                        = (known after apply)%0A      [32m+[0m [0m[1m[0mterraform_labels[0m[0m              = {%0A          [32m+[0m [0m"environment"                = "Prod"%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mtimeout[0m[0m                       = 60%0A      [32m+[0m [0m[1m[0mversion_id[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mvpc_connector_egress_settings[0m[0m = (known after apply)%0A%0A      [32m+[0m [0mevent_trigger {%0A          [32m+[0m [0m[1m[0mevent_type[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mresource[0m[0m   = (known after apply)%0A%0A          [32m+[0m [0mfailure_policy {%0A              [32m+[0m [0m[1m[0mretry[0m[0m = (known after apply)%0A            }%0A        }%0A    }%0A%0A[1m  # google_compute_address.static_ip[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_address" "static_ip" {%0A      [32m+[0m [0m[1m[0maddress[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0maddress_type[0m[0m       = "EXTERNAL"%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0meffective_labels[0m[0m   = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m  = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m               = "terraform-static-ip"%0A      [32m+[0m [0m[1m[0mnetwork_tier[0m[0m       = (known after apply)%0A      [32m+[0m [0m[1m[0mprefix_length[0m[0m      = (known after apply)%0A      [32m+[0m [0m[1m[0mproject[0m[0m            = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mpurpose[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mregion[0m[0m             = "us-central1"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0msubnetwork[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mterraform_labels[0m[0m   = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0musers[0m[0m              = (known after apply)%0A    }%0A%0A[1m  # google_compute_firewall.internal_firewall[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_firewall" "internal_firewall" {%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m               = "internal-firewall"%0A      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000%0A      [32m+[0m [0m[1m[0mproject[0m[0m            = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [%0A          [32m+[0m [0m"10.0.0.0/24",%0A        ]%0A%0A      [32m+[0m [0mallow {%0A          [32m+[0m [0m[1m[0mports[0m[0m    = [%0A              [32m+[0m [0m"0-65535",%0A            ]%0A          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"%0A        }%0A      [32m+[0m [0mallow {%0A          [32m+[0m [0m[1m[0mports[0m[0m    = [%0A              [32m+[0m [0m"0-65535",%0A            ]%0A          [32m+[0m [0m[1m[0mprotocol[0m[0m = "udp"%0A        }%0A      [32m+[0m [0mallow {%0A          [32m+[0m [0m[1m[0mports[0m[0m    = []%0A          [32m+[0m [0m[1m[0mprotocol[0m[0m = "icmp"%0A        }%0A    }%0A%0A[1m  # google_compute_firewall.public_vm_firewall[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_firewall" "public_vm_firewall" {%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mdirection[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m               = "public-vm-firewall"%0A      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000%0A      [32m+[0m [0m[1m[0mproject[0m[0m            = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [%0A          [32m+[0m [0m"0.0.0.0/0",%0A        ]%0A      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [%0A          [32m+[0m [0m"public-vm",%0A        ]%0A%0A      [32m+[0m [0mallow {%0A          [32m+[0m [0m[1m[0mports[0m[0m    = [%0A              [32m+[0m [0m"22",%0A              [32m+[0m [0m"80",%0A              [32m+[0m [0m"443",%0A            ]%0A          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"%0A        }%0A    }%0A%0A[1m  # google_compute_instance.my_instance[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_instance" "my_instance" {%0A      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false%0A      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)%0A      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)%0A      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false%0A      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {%0A          [32m+[0m [0m"environment"                = "production"%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A          [32m+[0m [0m"service"                    = "web-app"%0A        }%0A      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)%0A      [32m+[0m [0m[1m[0mlabels[0m[0m               = {%0A          [32m+[0m [0m"environment" = "production"%0A          [32m+[0m [0m"service"     = "web-app"%0A        }%0A      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "n1-standard-16"%0A      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m                 = "test"%0A      [32m+[0m [0m[1m[0mproject[0m[0m              = "test"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {%0A          [32m+[0m [0m"environment"                = "production"%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A          [32m+[0m [0m"service"                    = "web-app"%0A        }%0A      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"%0A%0A      [32m+[0m [0mboot_disk {%0A          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"%0A          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)%0A%0A          [32m+[0m [0minitialize_params {%0A              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)%0A              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-9"%0A              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)%0A              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)%0A              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)%0A              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mconfidential_instance_config {%0A          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mguest_accelerator {%0A          [32m+[0m [0m[1m[0mcount[0m[0m = 4%0A          [32m+[0m [0m[1m[0mtype[0m[0m  = "nvidia-tesla-t4"%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"%0A          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)%0A%0A          [32m+[0m [0maccess_config {%0A              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)%0A              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mreservation_affinity {%0A          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mspecific_reservation {%0A              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)%0A              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mscheduling {%0A          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m   = true%0A          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mpreemptible[0m[0m         = true%0A          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m  = (known after apply)%0A        }%0A    }%0A%0A[1m  # google_compute_instance.private_vm[0][0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_instance" "private_vm" {%0A      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false%0A      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)%0A      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)%0A      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false%0A      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)%0A      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"%0A      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {%0A          [32m+[0m [0m"ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDFB4ygMcxnTVTPknIyeIBcuMvh0oRl/9MVHAW1HBXzB/GNKqMk3WwvoOKXOe5s39rYaejCS1IVNu8yRtOn1kno8DaXCHtAnOnI1nIax2REDvuGJX8r6ZZTdperYFMF4MrrWakPYWzT2GLGSb+m2G3syvkZshZoj8o6I3ijHfMJ59vFWDgkJEJy6GpCnyWl9c9DGmlOpMD3zk9IfiLdfKZnPWIsIjGAknAJcCnqiS4n7D0q6Y7xA2EKIupvc37j/lbYoZb/XUGW6WI8fRufQjl/ay1sJFySGLi73CsFmpVefdArHPLuQM0zvQA62zxGTZqWubRVZXNSJKnzDp6jugqxXuXBgPsd1u6ZN+yjKvu6K9GQLQ48/T/xOFpFsZ0sf+EajCrQ2r2SahQ4fErH5SrdFSm+ZyLDiKAir2NbYSFw7yAkqHqrajYiYBtTC+Qsm9tI3djMwi6Uk719JR7Po5p7BGO/5vRHopOVb8p+w9C2LCiA9ACdL6GJH3gNId3OsLU= feri@MacBook-Pro-Feri.local"%0A        }%0A      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m                 = "private-vm-1"%0A      [32m+[0m [0m[1m[0mproject[0m[0m              = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"%0A%0A      [32m+[0m [0mboot_disk {%0A          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"%0A          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)%0A%0A          [32m+[0m [0minitialize_params {%0A              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)%0A              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-11"%0A              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)%0A              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)%0A              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)%0A              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mconfidential_instance_config {%0A          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mguest_accelerator {%0A          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)%0A        }%0A%0A      [32m+[0m [0mreservation_affinity {%0A          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mspecific_reservation {%0A              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)%0A              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mscheduling {%0A          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)%0A          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)%0A          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)%0A          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)%0A          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)%0A%0A          [32m+[0m [0mlocal_ssd_recovery_timeout {%0A              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)%0A              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)%0A            }%0A%0A          [32m+[0m [0mmax_run_duration {%0A              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)%0A              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)%0A            }%0A%0A          [32m+[0m [0mnode_affinities {%0A              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)%0A              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)%0A            }%0A%0A          [32m+[0m [0mon_instance_stop_action {%0A              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)%0A            }%0A        }%0A    }%0A%0A[1m  # google_compute_instance.private_vm[1][0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_instance" "private_vm" {%0A      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false%0A      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)%0A      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)%0A      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false%0A      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)%0A      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"%0A      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {%0A          [32m+[0m [0m"ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDFB4ygMcxnTVTPknIyeIBcuMvh0oRl/9MVHAW1HBXzB/GNKqMk3WwvoOKXOe5s39rYaejCS1IVNu8yRtOn1kno8DaXCHtAnOnI1nIax2REDvuGJX8r6ZZTdperYFMF4MrrWakPYWzT2GLGSb+m2G3syvkZshZoj8o6I3ijHfMJ59vFWDgkJEJy6GpCnyWl9c9DGmlOpMD3zk9IfiLdfKZnPWIsIjGAknAJcCnqiS4n7D0q6Y7xA2EKIupvc37j/lbYoZb/XUGW6WI8fRufQjl/ay1sJFySGLi73CsFmpVefdArHPLuQM0zvQA62zxGTZqWubRVZXNSJKnzDp6jugqxXuXBgPsd1u6ZN+yjKvu6K9GQLQ48/T/xOFpFsZ0sf+EajCrQ2r2SahQ4fErH5SrdFSm+ZyLDiKAir2NbYSFw7yAkqHqrajYiYBtTC+Qsm9tI3djMwi6Uk719JR7Po5p7BGO/5vRHopOVb8p+w9C2LCiA9ACdL6GJH3gNId3OsLU= feri@MacBook-Pro-Feri.local"%0A        }%0A      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m                 = "private-vm-2"%0A      [32m+[0m [0m[1m[0mproject[0m[0m              = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"%0A%0A      [32m+[0m [0mboot_disk {%0A          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"%0A          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)%0A%0A          [32m+[0m [0minitialize_params {%0A              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)%0A              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-11"%0A              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)%0A              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)%0A              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)%0A              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mconfidential_instance_config {%0A          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mguest_accelerator {%0A          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)%0A        }%0A%0A      [32m+[0m [0mreservation_affinity {%0A          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mspecific_reservation {%0A              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)%0A              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mscheduling {%0A          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)%0A          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)%0A          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)%0A          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)%0A          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)%0A%0A          [32m+[0m [0mlocal_ssd_recovery_timeout {%0A              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)%0A              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)%0A            }%0A%0A          [32m+[0m [0mmax_run_duration {%0A              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)%0A              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)%0A            }%0A%0A          [32m+[0m [0mnode_affinities {%0A              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)%0A              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)%0A            }%0A%0A          [32m+[0m [0mon_instance_stop_action {%0A              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)%0A            }%0A        }%0A    }%0A%0A[1m  # google_compute_instance.public_vm[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_instance" "public_vm" {%0A      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false%0A      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)%0A      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)%0A      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false%0A      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)%0A      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)%0A      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-small"%0A      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {%0A          [32m+[0m [0m"ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDFB4ygMcxnTVTPknIyeIBcuMvh0oRl/9MVHAW1HBXzB/GNKqMk3WwvoOKXOe5s39rYaejCS1IVNu8yRtOn1kno8DaXCHtAnOnI1nIax2REDvuGJX8r6ZZTdperYFMF4MrrWakPYWzT2GLGSb+m2G3syvkZshZoj8o6I3ijHfMJ59vFWDgkJEJy6GpCnyWl9c9DGmlOpMD3zk9IfiLdfKZnPWIsIjGAknAJcCnqiS4n7D0q6Y7xA2EKIupvc37j/lbYoZb/XUGW6WI8fRufQjl/ay1sJFySGLi73CsFmpVefdArHPLuQM0zvQA62zxGTZqWubRVZXNSJKnzDp6jugqxXuXBgPsd1u6ZN+yjKvu6K9GQLQ48/T/xOFpFsZ0sf+EajCrQ2r2SahQ4fErH5SrdFSm+ZyLDiKAir2NbYSFw7yAkqHqrajYiYBtTC+Qsm9tI3djMwi6Uk719JR7Po5p7BGO/5vRHopOVb8p+w9C2LCiA9ACdL6GJH3gNId3OsLU= feri@MacBook-Pro-Feri.local"%0A        }%0A      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m                 = "public-vm"%0A      [32m+[0m [0m[1m[0mproject[0m[0m              = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mtags[0m[0m                 = [%0A          [32m+[0m [0m"public-vm",%0A        ]%0A      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)%0A      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {%0A          [32m+[0m [0m"goog-terraform-provisioned" = "true"%0A        }%0A      [32m+[0m [0m[1m[0mzone[0m[0m                 = "us-central1-a"%0A%0A      [32m+[0m [0mboot_disk {%0A          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true%0A          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"%0A          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)%0A%0A          [32m+[0m [0minitialize_params {%0A              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)%0A              [32m+[0m [0m[1m[0mimage[0m[0m                  = "debian-cloud/debian-11"%0A              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)%0A              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)%0A              [32m+[0m [0m[1m[0msize[0m[0m                   = (known after apply)%0A              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)%0A              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mconfidential_instance_config {%0A          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)%0A          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)%0A        }%0A%0A      [32m+[0m [0mguest_accelerator {%0A          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)%0A        }%0A%0A      [32m+[0m [0mnetwork_interface {%0A          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)%0A          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)%0A          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)%0A          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)%0A%0A          [32m+[0m [0maccess_config {%0A              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)%0A              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mreservation_affinity {%0A          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)%0A%0A          [32m+[0m [0mspecific_reservation {%0A              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)%0A              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)%0A            }%0A        }%0A%0A      [32m+[0m [0mscheduling {%0A          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)%0A          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)%0A          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)%0A          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)%0A          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)%0A          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)%0A          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)%0A%0A          [32m+[0m [0mlocal_ssd_recovery_timeout {%0A              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)%0A              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)%0A            }%0A%0A          [32m+[0m [0mmax_run_duration {%0A              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)%0A              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)%0A            }%0A%0A          [32m+[0m [0mnode_affinities {%0A              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)%0A              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)%0A              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)%0A            }%0A%0A          [32m+[0m [0mon_instance_stop_action {%0A              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)%0A            }%0A        }%0A    }%0A%0A[1m  # google_compute_network.vpc_network[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_network" "vpc_network" {%0A      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m                   = false%0A      [32m+[0m [0m[1m[0mbgp_always_compare_med[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mbgp_best_path_selection_mode[0m[0m              = (known after apply)%0A      [32m+[0m [0m[1m[0mbgp_inter_region_cost[0m[0m                     = (known after apply)%0A      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m           = false%0A      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                                        = (known after apply)%0A      [32m+[0m [0m[1m[0minternal_ipv6_range[0m[0m                       = (known after apply)%0A      [32m+[0m [0m[1m[0mmtu[0m[0m                                       = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m                                      = "terraform-network"%0A      [32m+[0m [0m[1m[0mnetwork_firewall_policy_enforcement_order[0m[0m = "AFTER_CLASSIC_FIREWALL"%0A      [32m+[0m [0m[1m[0mnetwork_id[0m[0m                                = (known after apply)%0A      [32m+[0m [0m[1m[0mnumeric_id[0m[0m                                = (known after apply)%0A      [32m+[0m [0m[1m[0mproject[0m[0m                                   = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                              = (known after apply)%0A      [32m+[0m [0m[1m[0mself_link[0m[0m                                 = (known after apply)%0A    }%0A%0A[1m  # google_compute_subnetwork.subnet[0m will be created[0m[0m%0A[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnet" {%0A      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)%0A      [32m+[0m [0m[1m[0menable_flow_logs[0m[0m           = (known after apply)%0A      [32m+[0m [0m[1m[0mexternal_ipv6_prefix[0m[0m       = (known after apply)%0A      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)%0A      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)%0A      [32m+[0m [0m[1m[0minternal_ipv6_prefix[0m[0m       = (known after apply)%0A      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "10.0.0.0/24"%0A      [32m+[0m [0m[1m[0mipv6_cidr_range[0m[0m            = (known after apply)%0A      [32m+[0m [0m[1m[0mipv6_gce_endpoint[0m[0m          = (known after apply)%0A      [32m+[0m [0m[1m[0mname[0m[0m                       = "terraform-subnet"%0A      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_ip_google_access[0m[0m   = (known after apply)%0A      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)%0A      [32m+[0m [0m[1m[0mproject[0m[0m                    = "polished-tube-312806"%0A      [32m+[0m [0m[1m[0mpurpose[0m[0m                    = (known after apply)%0A      [32m+[0m [0m[1m[0mregion[0m[0m                     = "us-central1"%0A      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)%0A      [32m+[0m [0m[1m[0mstack_type[0m[0m                 = (known after apply)%0A      [32m+[0m [0m[1m[0mstate[0m[0m                      = (known after apply)%0A      [32m+[0m [0m[1m[0msubnetwork_id[0m[0m              = (known after apply)%0A%0A      [32m+[0m [0msecondary_ip_range {%0A          [32m+[0m [0m[1m[0mip_cidr_range[0m[0m           = (known after apply)%0A          [32m+[0m [0m[1m[0mrange_name[0m[0m              = (known after apply)%0A          [32m+[0m [0m[1m[0mreserved_internal_range[0m[0m = (known after apply)%0A        }%0A    }%0A%0A[0m[1mPlan:[0m 10 to add, 0 to change, 0 to destroy.%0A[0m[0m%0A[1mChanges to Outputs:[0m[0m%0A  [32m+[0m [0m[1m[0mprivate_vm_internal_ips[0m[0m = [%0A      [32m+[0m [0m(known after apply),%0A      [32m+[0m [0m(known after apply),%0A    ]%0A  [32m+[0m [0m[1m[0mprivate_vm_names[0m[0m        = [%0A      [32m+[0m [0m"private-vm-1",%0A      [32m+[0m [0m"private-vm-2",%0A    ]%0A  [32m+[0m [0m[1m[0mpublic_vm_external_ip[0m[0m   = (known after apply)%0A  [32m+[0m [0m[1m[0mpublic_vm_internal_ip[0m[0m   = (known after apply)%0A  [32m+[0m [0m[1m[0mpublic_vm_name[0m[0m          = "public-vm"%0A  [32m+[0m [0m[1m[0msubnet_cidr[0m[0m             = "10.0.0.0/24"%0A  [32m+[0m [0m[1m[0msubnet_name[0m[0m             = "terraform-subnet"%0A  [32m+[0m [0m[1m[0mvpc_network_name[0m[0m        = "terraform-network"%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  
  </details>
  
  *Command executed by: @feriahmad via `atlantis plan`*